package com.rect.etuattender.util;

import lombok.experimental.UtilityClass;

import java.time.LocalDateTime;

@UtilityClass
public class BotStrings {
    public String getEnterLkInfo(){
        return """
                Аутентификация с сохранением данных.\s
                Плюсы: удобный способ использования бота, однако ради этого я сохраняю ваш логин:пароль в базе данных, что позволяет мне автоматически обновлять токен доступа к ИС Посещаемость от ЛЭТИ.
                Минусы: относительно небезопасно хранить свои логин:пароль в недоступном напрямую для вас месте.

                Аутентификация без сохранения данных.\s
                Плюсы: более безопасный способ использования бота, ведь в этом случае я не сохраняю ваши логин:пароль, только токен, который действует 6 дней и может быть использован исключительно в сервисе ИС Посещаемость от ЛЭТИ.\s
                Минусы: срок действия, бот попросит пройти аутентификацию заново через 6 дней; при обновлении ИС Посещаемость аутентификация в боте слетает.""";
    }

    public String getMainMenuInfo(){
        return """

                Тех поддержка: @refrct

                Данный бот предназначен для автоматический отметки на парах и просмотра расписания""";
    }

    public String getLessonMenuInfo(LocalDateTime localDateTime, String auto){
        return "Срок действия токена: " + localDateTime +
                "\nАвтоматическая аутентификация: " + auto +
                "\nТех поддержка: @refrct" +
                "\n\nМеню расписание позволяет выбрать предметы, которые вы хотите отметить именно сегодня. " +
                "\nЛибо же, вы можете нажатием на кнопку Все пары включить отметку на все ваши пары на данной неделе. " +
                "\nРасписание обновляется каждый понедельник в 00:00 МСК" +
                "\nПриятного пользования!";
    }
}
